soap-builder/src/test/resources/services/test13/operations/PersonaServiceSOAPBinding/readPersonas.request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.ifyouwannabecool.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <api:readPersonas>
         <!--1 or more repetitions:-->
         <personaIds>?</personaIds>
      </api:readPersonas>
   </soapenv:Body>
</soapenv:Envelope>